---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.SteelElemWeldMainWeldprep
source: html/e8264361-0a14-8507-d614-7e05ce185955.htm
---
# Autodesk.Revit.DB.ParameterTypeId.SteelElemWeldMainWeldprep Property

"Main Weld preparation"

## Syntax (C#)
```csharp
public static ForgeTypeId SteelElemWeldMainWeldprep { get; }
```